# IS 362 - Project 3 
Sunah Lee

Combining information form a number of SQL tables, then displaying the information in a pandas DataFrame.

Foryourdatabase,youshoulddownloadandinstalltheappropriateversion of the Chinook database for your RDBMS, which is available here, under the downloads tab: https://chinookdatabase.codeplex.com/ (Redirected to: https://github.com/lerocha/chinook-database)

In [1]:
import  pandas as pd
import sqlite3

Your task is to create a pandas DataFrame that displays Customers’Last Name and First Name, and each customer’s purchased Track names and Album Titles. The information should be sorted by Customer LastName then Customer FirstName.

In [2]:
con = sqlite3.connect('Chinook_Sqlite.sqlite')
tracks = pd.read_sql_query("SELECT * from Track", con=con)

In [5]:
sql = '''SELECT c.LastName, c.FirstName, t.Name, a.Title
         FROM Customer as c
         LEFT JOIN Invoice as i
         ON c.CustomerId = i.CustomerId
         LEFT JOIN InvoiceLine as il
         ON i.InvoiceId = il.InvoiceId
         LEFT JOIN Track as t
         ON il.TrackId = t.TrackId
         LEFT JOIN Album as a
         ON t.AlbumId = a.AlbumId
         ORDER BY c.LastName, c.FirstName'''

con = sqlite3.connect("Chinook_Sqlite.sqlite")
db = pd.read_sql_query(sql , con=con).head(5)
con.close()
db

,LastName,FirstName,Name,Title
0,Almeida,Roberto,Right Next Door to Hell,Use Your Illusion I
1,Almeida,Roberto,In The Evening,In Through The Out Door
2,Almeida,Roberto,Fool In The Rain,In Through The Out Door
3,Almeida,Roberto,Saudade Dos Aviões Da Panair (Conversando No Bar),Minas
4,Almeida,Roberto,Caso Você Queira Saber,Minas